## Staging: network
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 49 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                  NAME                                                  |
|--------|--------------------------------------------------------------------------------------------------------|
| add    | `aws_flow_log.cloud_based_sensor`                                                                      |
|        | `aws_security_group.api`                                                                               |
|        | `aws_security_group.vpc_endpoint`                                                                      |
|        | `aws_security_group_rule.api_egress_internet`                                                          |
|        | `aws_security_group_rule.s3_private_endpoint_ingress`                                                  |
|        | `aws_security_group_rule.vpc_endpoint_dynamodb_ingress`                                                |
|        | `aws_security_group_rule.vpc_endpoint_interface_ingress`                                               |
|        | `aws_vpc_endpoint.dynamodb`                                                                            |
|        | `aws_vpc_endpoint.logs`                                                                                |
|        | `aws_vpc_endpoint.s3`                                                                                  |
|        | `module.url_shortener_vpc.aws_cloudwatch_log_group.flow_logs[0]`                                       |
|        | `module.url_shortener_vpc.aws_default_network_acl.default`                                             |
|        | `module.url_shortener_vpc.aws_default_route_table.default`                                             |
|        | `module.url_shortener_vpc.aws_default_security_group.default`                                          |
|        | `module.url_shortener_vpc.aws_eip.nat[0]`                                                              |
|        | `module.url_shortener_vpc.aws_flow_log.flow_logs[0]`                                                   |
|        | `module.url_shortener_vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0]`                        |
|        | `module.url_shortener_vpc.aws_iam_role.flow_logs[0]`                                                   |
|        | `module.url_shortener_vpc.aws_iam_role_policy_attachment.vpc_metrics_flow_logs_write_policy_attach[0]` |
|        | `module.url_shortener_vpc.aws_internet_gateway.gw`                                                     |
|        | `module.url_shortener_vpc.aws_nat_gateway.nat_gw[0]`                                                   |
|        | `module.url_shortener_vpc.aws_network_acl.main`                                                        |
|        | `module.url_shortener_vpc.aws_network_acl_rule.block_rdp[0]`                                           |
|        | `module.url_shortener_vpc.aws_network_acl_rule.block_ssh[0]`                                           |
|        | `module.url_shortener_vpc.aws_network_acl_rule.https_request_egress_443[0]`                            |
|        | `module.url_shortener_vpc.aws_network_acl_rule.https_request_in_ingress_443[0]`                        |
|        | `module.url_shortener_vpc.aws_network_acl_rule.https_request_in_ingress_ephemeral[0]`                  |
|        | `module.url_shortener_vpc.aws_network_acl_rule.https_request_in_response_egress_443[0]`                |
|        | `module.url_shortener_vpc.aws_network_acl_rule.https_request_in_response_egress_ephemeral[0]`          |
|        | `module.url_shortener_vpc.aws_network_acl_rule.https_request_out_egress_ephemeral[0]`                  |
|        | `module.url_shortener_vpc.aws_network_acl_rule.https_request_out_response_ingress_443[0]`              |
|        | `module.url_shortener_vpc.aws_network_acl_rule.https_request_out_response_ingress_ephemeral[0]`        |
|        | `module.url_shortener_vpc.aws_route.private_nat_gateway[0]`                                            |
|        | `module.url_shortener_vpc.aws_route.public_internet_gateway`                                           |
|        | `module.url_shortener_vpc.aws_route_table.private[0]`                                                  |
|        | `module.url_shortener_vpc.aws_route_table.public`                                                      |
|        | `module.url_shortener_vpc.aws_route_table_association.private[0]`                                      |
|        | `module.url_shortener_vpc.aws_route_table_association.private[1]`                                      |
|        | `module.url_shortener_vpc.aws_route_table_association.private[2]`                                      |
|        | `module.url_shortener_vpc.aws_route_table_association.public[0]`                                       |
|        | `module.url_shortener_vpc.aws_route_table_association.public[1]`                                       |
|        | `module.url_shortener_vpc.aws_route_table_association.public[2]`                                       |
|        | `module.url_shortener_vpc.aws_subnet.private[0]`                                                       |
|        | `module.url_shortener_vpc.aws_subnet.private[1]`                                                       |
|        | `module.url_shortener_vpc.aws_subnet.private[2]`                                                       |
|        | `module.url_shortener_vpc.aws_subnet.public[0]`                                                        |
|        | `module.url_shortener_vpc.aws_subnet.public[1]`                                                        |
|        | `module.url_shortener_vpc.aws_subnet.public[2]`                                                        |
|        | `module.url_shortener_vpc.aws_vpc.main`                                                                |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/url-shortener/actions/runs/4138589944).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_flow_log.cloud_based_sensor will be created
  + resource "aws_flow_log" "cloud_based_sensor" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + log_destination          = "arn:aws:s3:::cbs-satellite-843973686572/vpc_flow_logs/"
      + log_destination_type     = "s3"
      + log_format               = "${vpc-id} ${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status} ${subnet-id} ${instance-id}"
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_security_group.api will be created
  + resource "aws_security_group" "api" {
      + arn                    = (known after apply)
      + description            = "SG for the URL shortener API"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "url-shortener_api_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener_api_sg"
        }
      + tags_all               = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener_api_sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.vpc_endpoint will be created
  + resource "aws_security_group" "vpc_endpoint" {
      + arn                    = (known after apply)
      + description            = "PrivateLink VPC endpoints"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "vpc_endpoints"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener_api_sg"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener_api_sg"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.api_egress_internet will be created
  + resource "aws_security_group_rule" "api_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow TCP egress connections to the internet on port 443"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.s3_private_endpoint_ingress will be created
  + resource "aws_security_group_rule" "s3_private_endpoint_ingress" {
      + description              = "Ingress from the private S3 endpoint"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.vpc_endpoint_dynamodb_ingress will be created
  + resource "aws_security_group_rule" "vpc_endpoint_dynamodb_ingress" {
      + description              = "Ingress from the private DynamoDB endpoint"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.vpc_endpoint_interface_ingress will be created
  + resource "aws_security_group_rule" "vpc_endpoint_interface_ingress" {
      + description              = "Ingress from the API security group to the private interface endpoints"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_vpc_endpoint.dynamodb will be created
  + resource "aws_vpc_endpoint" "dynamodb" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + dns_options {
          + dns_record_ip_type = (known after apply)
        }
    }

  # aws_vpc_endpoint.logs will be created
  + resource "aws_vpc_endpoint" "logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.logs"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options {
          + dns_record_ip_type = (known after apply)
        }
    }

  # aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + dns_options {
          + dns_record_ip_type = (known after apply)
        }
    }

  # module.url_shortener_vpc.data.aws_iam_policy_document.vpc_metrics_flow_logs_write[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_metrics_flow_logs_write" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.url_shortener_vpc.aws_cloudwatch_log_group.flow_logs[0] will be created
  + resource "aws_cloudwatch_log_group" "flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "url-shortener_flow_logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
    }

  # module.url_shortener_vpc.aws_default_network_acl.default will be created
  + resource "aws_default_network_acl" "default" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener_default_nacl"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener_default_nacl"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.url_shortener_vpc.aws_default_route_table.default will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = []
      + tags                   = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
          + "name"       = "url-shortener_default_route_table"
        }
      + tags_all               = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
          + "name"       = "url-shortener_default_route_table"
        }
      + vpc_id                 = (known after apply)
    }

  # module.url_shortener_vpc.aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener_default_sg"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener_default_sg"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.url_shortener_vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener-eip0"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener-eip0"
          + "Terraform"  = "true"
        }
      + vpc                  = true
    }

  # module.url_shortener_vpc.aws_flow_log.flow_logs[0] will be created
  + resource "aws_flow_log" "flow_logs" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.url_shortener_vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0] will be created
  + resource "aws_iam_policy" "vpc_metrics_flow_logs_write_policy" {
      + arn         = (known after apply)
      + description = "IAM policy for writing flow logs in CloudWatch"
      + id          = (known after apply)
      + name        = "VpcMetricsFlowLogsWrite"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
    }

  # module.url_shortener_vpc.aws_iam_role.flow_logs[0] will be created
  + resource "aws_iam_role" "flow_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "url-shortener_flow_logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.url_shortener_vpc.aws_iam_role_policy_attachment.vpc_metrics_flow_logs_write_policy_attach[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_metrics_flow_logs_write_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "url-shortener_flow_logs"
    }

  # module.url_shortener_vpc.aws_internet_gateway.gw will be created
  + resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener_internet_gateway"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener_internet_gateway"
          + "Terraform"  = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.url_shortener_vpc.aws_nat_gateway.nat_gw[0] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener-natgw-0"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener-natgw-0"
          + "Terraform"  = "true"
        }
    }

  # module.url_shortener_vpc.aws_network_acl.main will be created
  + resource "aws_network_acl" "main" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener_main_nacl"
          + "Terraform"  = "true"
        }
      + tags_all   = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener_main_nacl"
          + "Terraform"  = "true"
        }
      + vpc_id     = (known after apply)
    }

  # module.url_shortener_vpc.aws_network_acl_rule.block_rdp[0] will be created
  + resource "aws_network_acl_rule" "block_rdp" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = false
      + from_port      = 3389
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "deny"
      + rule_number    = 51
      + to_port        = 3389
    }

  # module.url_shortener_vpc.aws_network_acl_rule.block_ssh[0] will be created
  + resource "aws_network_acl_rule" "block_ssh" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = false
      + from_port      = 22
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "deny"
      + rule_number    = 50
      + to_port        = 22
    }

  # module.url_shortener_vpc.aws_network_acl_rule.https_request_egress_443[0] will be created
  + resource "aws_network_acl_rule" "https_request_egress_443" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 60
      + to_port        = 443
    }

  # module.url_shortener_vpc.aws_network_acl_rule.https_request_in_ingress_443[0] will be created
  + resource "aws_network_acl_rule" "https_request_in_ingress_443" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 70
      + to_port        = 443
    }

  # module.url_shortener_vpc.aws_network_acl_rule.https_request_in_ingress_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "https_request_in_ingress_ephemeral" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 71
      + to_port        = 65535
    }

  # module.url_shortener_vpc.aws_network_acl_rule.https_request_in_response_egress_443[0] will be created
  + resource "aws_network_acl_rule" "https_request_in_response_egress_443" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = true
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 72
      + to_port        = 443
    }

  # module.url_shortener_vpc.aws_network_acl_rule.https_request_in_response_egress_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "https_request_in_response_egress_ephemeral" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 73
      + to_port        = 65535
    }

  # module.url_shortener_vpc.aws_network_acl_rule.https_request_out_egress_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "https_request_out_egress_ephemeral" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = true
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 61
      + to_port        = 65535
    }

  # module.url_shortener_vpc.aws_network_acl_rule.https_request_out_response_ingress_443[0] will be created
  + resource "aws_network_acl_rule" "https_request_out_response_ingress_443" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = false
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 62
      + to_port        = 443
    }

  # module.url_shortener_vpc.aws_network_acl_rule.https_request_out_response_ingress_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "https_request_out_response_ingress_ephemeral" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 63
      + to_port        = 65535
    }

  # module.url_shortener_vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.url_shortener_vpc.aws_route.public_internet_gateway will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.url_shortener_vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener_private_route_table_0"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener_private_route_table_0"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.url_shortener_vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener_public_route_table"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "url-shortener-staging"
          + "Name"       = "url-shortener_public_route_table"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.url_shortener_vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.url_shortener_vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.url_shortener_vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.url_shortener_vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.url_shortener_vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.url_shortener_vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.url_shortener_vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1a"
      + availability_zone_id                           = (known after apply)
 ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
